import fs from 'fs'

// 环形链表 II
//给定一个链表的头节点 head ，返回链表开始入环的第一个节点。 如果链表无环，则返回 null。
//
// 如果链表中有某个节点，可以通过连续跟踪 next 指针再次到达，则链表中存在环。 为了表示给定链表中的环，评测系统内部使用整数 pos 来表示链表尾连接到
//链表中的位置（索引从 0 开始）。如果 pos 是 -1，则在该链表中没有环。注意：pos 不作为参数进行传递，仅仅是为了标识链表的实际情况。
//
// 不允许修改 链表。
//
//
//
//
//
//
// 示例 1：
//
//
//
//
//输入：head = [3,2,0,-4], pos = 1
//输出：返回索引为 1 的链表节点
//解释：链表中有一个环，其尾部连接到第二个节点。
//
//
// 示例 2：
//
//
//
//
//输入：head = [1,2], pos = 0
//输出：返回索引为 0 的链表节点
//解释：链表中有一个环，其尾部连接到第一个节点。
//
//
// 示例 3：
//
//
//
//
//输入：head = [1], pos = -1
//输出：返回 null
//解释：链表中没有环。
//
//
//
//
// 提示：
//
//
// 链表中节点的数目范围在范围 [0, 10⁴] 内
// -10⁵ <= Node.val <= 10⁵
// pos 的值为 -1 或者链表中的一个有效索引
//
//
//
//
// 进阶：你是否可以使用 O(1) 空间解决此题？
//
// Related Topics 哈希表 链表 双指针 👍 1909 👎 0

//leetcode submit region begin(Prohibit modification and deletion)
/**
 * Definition for singly-linked list.
 * class ListNode {
 *     val: number
 *     next: ListNode | null
 *     constructor(val?: number, next?: ListNode | null) {
 *         this.val = (val===undefined ? 0 : val)
 *         this.next = (next===undefined ? null : next)
 *     }
 * }
 */

function detectCycle(head: ListNode | null): ListNode | null {
  const map = new Map();
  let n = head;
  while (n) {
    if (map.get(n.next)) return n.next;
    map.set(n, 1);
    n = n.next;
  }
  return null;
}
//leetcode submit region end(Prohibit modification and deletion)
const data = {
  sheet1: [
    {
      "2022-2023学年第1学期教学班点名册": "开课学院：马克思主义学院",
      __EMPTY_2: "课程名称：思想道德与法治",
      __EMPTY_7: "学分：3.0",
    },
    {
      "2022-2023学年第1学期教学班点名册": "教师单位：马克思主义学院",
      __EMPTY_2: "任课教师：余慧菊",
      __EMPTY_5: "课号：(2022-2023-1)-601080001-18",
    },
    {
      "2022-2023学年第1学期教学班点名册": "上课时间：星期四第3-5节{1-16周}",
      __EMPTY_3: "上课地点：勤园8号楼101",
    },
    {
      "2022-2023学年第1学期教学班点名册": "序号",
      __EMPTY: "学号",
      __EMPTY_1: "姓名",
      __EMPTY_2: "班级",
      __EMPTY_3: "分组组别",
      __EMPTY_4: "发言次数",
      __EMPTY_5: "平时3",
      __EMPTY_6: "平时4",
      __EMPTY_7: "平时5",
      __EMPTY_8: "期末",
      __EMPTY_9: "展示小组",
    },
    {
      "2022-2023学年第1学期教学班点名册": 1,
      __EMPTY: "2022211505139",
      __EMPTY_1: "王子桉",
      __EMPTY_2: "药学225",
      __EMPTY_9:3
    },
    {
      "2022-2023学年第1学期教学班点名册": 2,
      __EMPTY: "2022211505140",
      __EMPTY_1: "陈璐瑶",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 3,
      __EMPTY: "2022211505141",
      __EMPTY_1: "张朝雪",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 4,
      __EMPTY: "2022211505142",
      __EMPTY_1: "向罗奕",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 5,
      __EMPTY: "2022211505143",
      __EMPTY_1: "戴恩慈",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 6,
      __EMPTY: "2022211505144",
      __EMPTY_1: "竺一凡",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 7,
      __EMPTY: "2022211505145",
      __EMPTY_1: "周莹莹",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 8,
      __EMPTY: "2022211505146",
      __EMPTY_1: "周玉婷",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 9,
      __EMPTY: "2022211505147",
      __EMPTY_1: "张琪悦",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 10,
      __EMPTY: "2022211505148",
      __EMPTY_1: "骆冰冰",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 11,
      __EMPTY: "2022211505149",
      __EMPTY_1: "李秀文",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 12,
      __EMPTY: "2022211505150",
      __EMPTY_1: "王申",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 13,
      __EMPTY: "2022211505151",
      __EMPTY_1: "党心悦",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 14,
      __EMPTY: "2022211505152",
      __EMPTY_1: "汪赟",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 15,
      __EMPTY: "2022211505153",
      __EMPTY_1: "邹月敏",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 16,
      __EMPTY: "2022211505154",
      __EMPTY_1: "吴佳玉",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 17,
      __EMPTY: "2022211505155",
      __EMPTY_1: "陈诗妍",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 18,
      __EMPTY: "2022211505156",
      __EMPTY_1: "马向东",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 19,
      __EMPTY: "2022211505157",
      __EMPTY_1: "司远",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 20,
      __EMPTY: "2022211505158",
      __EMPTY_1: "宋静怡",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 21,
      __EMPTY: "2022211505159",
      __EMPTY_1: "杨静",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 22,
      __EMPTY: "2022211505160",
      __EMPTY_1: "贾译程",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 23,
      __EMPTY: "2022211505161",
      __EMPTY_1: "郑振帅",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 24,
      __EMPTY: "2022211505162",
      __EMPTY_1: "胡溶溶",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 25,
      __EMPTY: "2022211505163",
      __EMPTY_1: "刘霄霄",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 26,
      __EMPTY: "2022211505164",
      __EMPTY_1: "朱峻",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 27,
      __EMPTY: "2022211505165",
      __EMPTY_1: "朱睿硕",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 28,
      __EMPTY: "2022211505166",
      __EMPTY_1: "唐小淇",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 29,
      __EMPTY: "2022211505168",
      __EMPTY_1: "曹欣荣",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 30,
      __EMPTY: "2022211505169",
      __EMPTY_1: "赵庆申",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 31,
      __EMPTY: "2022211505170",
      __EMPTY_1: "毕存旭",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 32,
      __EMPTY: "2022211505171",
      __EMPTY_1: "郑欣怡",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 33,
      __EMPTY: "2022211505172",
      __EMPTY_1: "何昌峰",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 34,
      __EMPTY: "2022211505173",
      __EMPTY_1: "邵兵",
      __EMPTY_2: "药学225",
    },
    {
      "2022-2023学年第1学期教学班点名册": 35,
      __EMPTY: "2022211506081",
      __EMPTY_1: "鲍贤淑",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 36,
      __EMPTY: "2022211506082",
      __EMPTY_1: "陈成",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 37,
      __EMPTY: "2022211506083",
      __EMPTY_1: "陈佳",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 38,
      __EMPTY: "2022211506084",
      __EMPTY_1: "陈小诺",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 39,
      __EMPTY: "2022211506085",
      __EMPTY_1: "陈薏好",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 40,
      __EMPTY: "2022211506086",
      __EMPTY_1: "次仁平措",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 41,
      __EMPTY: "2022211506087",
      __EMPTY_1: "崔含悦",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 42,
      __EMPTY: "2022211506088",
      __EMPTY_1: "戴鹏辉",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 43,
      __EMPTY: "2022211506089",
      __EMPTY_1: "董百通",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 44,
      __EMPTY: "2022211506090",
      __EMPTY_1: "董琳",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 45,
      __EMPTY: "2022211506091",
      __EMPTY_1: "高宇晨",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 46,
      __EMPTY: "2022211506092",
      __EMPTY_1: "江嘉俊",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 47,
      __EMPTY: "2022211506093",
      __EMPTY_1: "蒋清华",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 48,
      __EMPTY: "2022211506094",
      __EMPTY_1: "林宗鸿",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 49,
      __EMPTY: "2022211506095",
      __EMPTY_1: "刘伊婷",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 50,
      __EMPTY: "2022211506096",
      __EMPTY_1: "马俊凯",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 51,
      __EMPTY: "2022211506097",
      __EMPTY_1: "庞小睿",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 52,
      __EMPTY: "2022211506098",
      __EMPTY_1: "曲尼多吉",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 53,
      __EMPTY: "2022211506099",
      __EMPTY_1: "任艳卿",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 54,
      __EMPTY: "2022211506100",
      __EMPTY_1: "施怡",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 55,
      __EMPTY: "2022211506101",
      __EMPTY_1: "汤懿萱",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 56,
      __EMPTY: "2022211506102",
      __EMPTY_1: "田龙",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 57,
      __EMPTY: "2022211506103",
      __EMPTY_1: "汪佳慧",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 58,
      __EMPTY: "2022211506104",
      __EMPTY_1: "王瑜丽",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 59,
      __EMPTY: "2022211506105",
      __EMPTY_1: "吴炫克",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 60,
      __EMPTY: "2022211506106",
      __EMPTY_1: "吴优",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 61,
      __EMPTY: "2022211506107",
      __EMPTY_1: "熊春红",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 62,
      __EMPTY: "2022211506108",
      __EMPTY_1: "徐菽隶",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 63,
      __EMPTY: "2022211506109",
      __EMPTY_1: "许译元",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 64,
      __EMPTY: "2022211506110",
      __EMPTY_1: "薛雅茹",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 65,
      __EMPTY: "2022211506111",
      __EMPTY_1: "杨雨彤",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 66,
      __EMPTY: "2022211506112",
      __EMPTY_1: "尹湘",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 67,
      __EMPTY: "2022211506113",
      __EMPTY_1: "余悦",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 68,
      __EMPTY: "2022211506114",
      __EMPTY_1: "余越",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 69,
      __EMPTY: "2022211506115",
      __EMPTY_1: "扎西罗布",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 70,
      __EMPTY: "2022211506116",
      __EMPTY_1: "张俊琪",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 71,
      __EMPTY: "2022211506117",
      __EMPTY_1: "张璐",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 72,
      __EMPTY: "2022211506118",
      __EMPTY_1: "张魏缘",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 73,
      __EMPTY: "2022211506119",
      __EMPTY_1: "周智怡",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 74,
      __EMPTY: "2022211506120",
      __EMPTY_1: "朱恭慧",
      __EMPTY_2: "预防医学223",
    },
    {
      "2022-2023学年第1学期教学班点名册": 75,
      __EMPTY: "2022211506121",
      __EMPTY_1: "陈琪莹",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 76,
      __EMPTY: "2022211506122",
      __EMPTY_1: "程可欣",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 77,
      __EMPTY: "2022211506123",
      __EMPTY_1: "戴乐乐",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 78,
      __EMPTY: "2022211506124",
      __EMPTY_1: "龚渝茗",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 79,
      __EMPTY: "2022211506125",
      __EMPTY_1: "郭维娜",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 80,
      __EMPTY: "2022211506126",
      __EMPTY_1: "何莹",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 81,
      __EMPTY: "2022211506127",
      __EMPTY_1: "贺蔓妮",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 82,
      __EMPTY: "2022211506128",
      __EMPTY_1: "金慧茜",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 83,
      __EMPTY: "2022211506129",
      __EMPTY_1: "金纪渊",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 84,
      __EMPTY: "2022211506130",
      __EMPTY_1: "蓝童瑜",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 85,
      __EMPTY: "2022211506132",
      __EMPTY_1: "李珺琰",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 86,
      __EMPTY: "2022211506133",
      __EMPTY_1: "李钰",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 87,
      __EMPTY: "2022211506134",
      __EMPTY_1: "林轩",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 88,
      __EMPTY: "2022211506135",
      __EMPTY_1: "卢金山",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 89,
      __EMPTY: "2022211506137",
      __EMPTY_1: "陆德萍",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 90,
      __EMPTY: "2022211506138",
      __EMPTY_1: "马梦婷",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 91,
      __EMPTY: "2022211506139",
      __EMPTY_1: "马烨鑫",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 92,
      __EMPTY: "2022211506140",
      __EMPTY_1: "孟智娴",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 93,
      __EMPTY: "2022211506141",
      __EMPTY_1: "莫昌兴",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 94,
      __EMPTY: "2022211506142",
      __EMPTY_1: "邱逸朵",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 95,
      __EMPTY: "2022211506143",
      __EMPTY_1: "万婷慧",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 96,
      __EMPTY: "2022211506144",
      __EMPTY_1: "王成",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 97,
      __EMPTY: "2022211506145",
      __EMPTY_1: "王洁",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 98,
      __EMPTY: "2022211506146",
      __EMPTY_1: "王硕",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 99,
      __EMPTY: "2022211506147",
      __EMPTY_1: "王瑶",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 100,
      __EMPTY: "2022211506148",
      __EMPTY_1: "吴语嫣",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 101,
      __EMPTY: "2022211506149",
      __EMPTY_1: "夏秀菲",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 102,
      __EMPTY: "2022211506150",
      __EMPTY_1: "肖宇杰",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 103,
      __EMPTY: "2022211506151",
      __EMPTY_1: "徐涵起",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 104,
      __EMPTY: "2022211506152",
      __EMPTY_1: "徐颖",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 105,
      __EMPTY: "2022211506153",
      __EMPTY_1: "叶祺",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 106,
      __EMPTY: "2022211506154",
      __EMPTY_1: "扆雨鑫",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 107,
      __EMPTY: "2022211506155",
      __EMPTY_1: "岳金洋",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 108,
      __EMPTY: "2022211506156",
      __EMPTY_1: "赵劲帆",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 109,
      __EMPTY: "2022211506157",
      __EMPTY_1: "赵珊珊",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 110,
      __EMPTY: "2022211506158",
      __EMPTY_1: "郑菲",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 111,
      __EMPTY: "2022211506159",
      __EMPTY_1: "周俊彦",
      __EMPTY_2: "预防医学224",
    },
    {
      "2022-2023学年第1学期教学班点名册": 112,
      __EMPTY: "2022211506160",
      __EMPTY_1: "朱琬祺",
      __EMPTY_2: "预防医学224",
    },
  ],
  Sheet2: [
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": "组别",
      __EMPTY: "准备专题",
      __EMPTY_1: "呈现方式",
      __EMPTY_2: "组长",
      __EMPTY_3: "联系方式",
      __EMPTY_4: "小组名字",
      __EMPTY_5: "组员1",
      __EMPTY_6: "组员2",
      __EMPTY_7: "组员3",
      __EMPTY_8: "组员4",
      __EMPTY_9: "组员5",
      __EMPTY_10: "组员6",
      __EMPTY_11: "组员7",
      __EMPTY_12: "组员8",
      __EMPTY_13: "组员9",
      __EMPTY_14: "组员10",
      __EMPTY_15: "组员11",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 1,
      __EMPTY: "二",
      __EMPTY_1: "Vlog",
      __EMPTY_2: "杨雨彤",
      __EMPTY_3: 13333223571,
      __EMPTY_4: "人民当家做组",
      __EMPTY_5: "徐菽隶（预防223）",
      __EMPTY_6: "许译元（预防223）",
      __EMPTY_7: "薛雅茹（预防223）",
      __EMPTY_8: "陈小诺（预防223）",
      __EMPTY_9: "鲍贤淑（预防223）",
      __EMPTY_10: "蒋清华（预防223）",
      __EMPTY_11: "陈佳（预防223）",
      __EMPTY_12: "任艳卿（预防223）",
      __EMPTY_13: "任艳卿（预防223）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 2,
      __EMPTY: "三",
      __EMPTY_1: "PPT",
      __EMPTY_2: "戴恩慈",
      __EMPTY_3: 18814995786,
      __EMPTY_4: "正经菜菜组",
      __EMPTY_5: "张朝雪（药225）",
      __EMPTY_6: "向罗奕（药225）",
      __EMPTY_7: "陈璐瑶（药225）",
      __EMPTY_8: "周莹莹（药225）",
      __EMPTY_9: "周玉婷（药225）",
      __EMPTY_10: "张琪悦（药225）",
      __EMPTY_11: "骆冰冰（药225）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 3,
      __EMPTY: "四",
      __EMPTY_1: "Vlog",
      __EMPTY_2: "施怡",
      __EMPTY_3: 19106826376,
      __EMPTY_4: "我们说什么都队",
      __EMPTY_5: "崔含悦（预防223）",
      __EMPTY_6: "刘伊婷（预防223）",
      __EMPTY_7: "董琳（预防223）",
      __EMPTY_8: "陈薏好（预防223）",
      __EMPTY_9: "余越（预防223）",
      __EMPTY_10: "朱恭慧（预防223）",
      __EMPTY_11: "张魏缘（预防223）",
      __EMPTY_12: "张俊琪（预防223）",
      __EMPTY_13: "王瑜丽（预防223）",
      __EMPTY_14: "熊春红（预防223）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 4,
      __EMPTY: "五",
      __EMPTY_1: "PPT",
      __EMPTY_2: "孟智娴",
      __EMPTY_3: 18867138785,
      __EMPTY_4: "笑blue齿组",
      __EMPTY_5: "马烨鑫（预224）",
      __EMPTY_6: "邱逸朵（预224）",
      __EMPTY_7: "王洁（预224）",
      __EMPTY_8: "郭维娜（预224）",
      __EMPTY_9: "陈琪莹（预224）",
      __EMPTY_10: "程可欣（预224）",
      __EMPTY_11: "何莹（预224）",
      __EMPTY_12: "朱婉琪（预224）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 5,
      __EMPTY: "六",
      __EMPTY_1: "PPT",
      __EMPTY_2: "汤懿萱",
      __EMPTY_3: 19106824069,
      __EMPTY_4: "杭师吴彦组",
      __EMPTY_5: "汪佳慧（预防223）",
      __EMPTY_6: "庞小睿（预防223）",
      __EMPTY_7: "张璐（预防223）",
      __EMPTY_8: "尹湘（预防223）",
      __EMPTY_9: "周智怡（预防223）",
      __EMPTY_10: "余悦（预防223）",
      __EMPTY_11: "吴优（预防223）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 6,
      __EMPTY: "七",
      __EMPTY_1: "PPT",
      __EMPTY_2: "龚渝茗",
      __EMPTY_3: 17816957945,
      __EMPTY_4: "不吃关东组",
      __EMPTY_5: "戴乐乐（预224）",
      __EMPTY_6: "李珺琰（预224）",
      __EMPTY_7: "卢金山（预224）",
      __EMPTY_8: "李钰（预224）",
      __EMPTY_9: "陆德萍（预224）",
      __EMPTY_10: "马梦婷（预224）",
      __EMPTY_11: "岳金洋(预224)",
      __EMPTY_12: "徐颖（预224）",
      __EMPTY_13: "扆雨鑫（预224）",
      __EMPTY_14: "叶祺（预224）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 7,
      __EMPTY: "八",
      __EMPTY_1: "PPT",
      __EMPTY_2: "郑欣怡",
      __EMPTY_3: 19106826120,
      __EMPTY_4: "我的青春我做组",
      __EMPTY_5: "唐小淇（药225）",
      __EMPTY_6: "陈诗妍（药225）",
      __EMPTY_7: "司远（药225）",
      __EMPTY_8: "邹月敏（药225）",
      __EMPTY_9: "吴佳玉（药225）",
      __EMPTY_10: "曹欣荣（药225）",
      __EMPTY_11: "邵兵（药225）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 8,
      __EMPTY: "九",
      __EMPTY_1: "小品",
      __EMPTY_2: "王子桉",
      __EMPTY_3: 18314927021,
      __EMPTY_4: "风林火山",
      __EMPTY_5: "毕存旭（药225）",
      __EMPTY_6: "何昌风（药225）",
      __EMPTY_7: "竺一凡（药225）",
      __EMPTY_8: "马向东（药225）",
      __EMPTY_9: "贾译程（药225）",
      __EMPTY_10: "郑振帅（药225）",
      __EMPTY_11: "朱峻（药225）",
      __EMPTY_12: "朱睿硕（药225）",
      __EMPTY_13: "赵庆申（药225）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 9,
      __EMPTY: "九",
      __EMPTY_1: "ppt",
      __EMPTY_2: "周俊彦",
      __EMPTY_3: 15060620192,
      __EMPTY_4: "吴彦组",
      __EMPTY_5: "肖宇杰（预224）",
      __EMPTY_6: "徐涵起（预224）",
      __EMPTY_7: "赵劲帆（预224）",
      __EMPTY_8: "吴语嫣（预224）",
      __EMPTY_9: "夏秀菲（预224）",
      __EMPTY_10: "万婷慧（预224）",
      __EMPTY_11: "王瑶（预224）",
      __EMPTY_12: "赵珊珊（预224）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 10,
      __EMPTY: "十",
      __EMPTY_1: "ppt",
      __EMPTY_2: "莫昌兴",
      __EMPTY_3: 13321745554,
      __EMPTY_4: "人民当家作组",
      __EMPTY_5: "金纪渊（预防224）",
      __EMPTY_6: "金慧茜（预防224）",
      __EMPTY_7: "贺蔓妮（预防224）",
      __EMPTY_8: "蓝童瑜（预防224）",
      __EMPTY_9: "郑菲（224）",
      __EMPTY_10: "王成（224）",
      __EMPTY_11: "王硕（224）",
      __EMPTY_12: "林轩（224）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 11,
      __EMPTY: "十一",
      __EMPTY_1: "ppt",
      __EMPTY_2: "董百通",
      __EMPTY_3: 19106824028,
      __EMPTY_4: "欢乐斗地组",
      __EMPTY_5: "戴鹏辉（预防223）",
      __EMPTY_6: "陈成（预防223）",
      __EMPTY_7: "高宇晨（预防223）",
      __EMPTY_8: "江嘉俊（预防223）",
      __EMPTY_9: "林宗鸿（预防223）",
      __EMPTY_10: "马俊凯（预防223）",
      __EMPTY_11: "田龙（预防223）",
      __EMPTY_12: "吴炫克（预防223）",
      __EMPTY_13: "次仁平措（预防223）",
      __EMPTY_14: "扎西罗布（预防223）",
      __EMPTY_15: "曲尼多吉（预防223）",
    },
    {
      "《思想道德与法治》小组课堂展示表（预防223、224 药学225）": 12,
      __EMPTY: "十二",
      __EMPTY_1: "PPT",
      __EMPTY_2: "胡溶溶",
      __EMPTY_3: 13069326663,
      __EMPTY_4: "汤臣一品业户组",
      __EMPTY_5: "宋静怡（药225）",
      __EMPTY_6: "杨静（药225）",
      __EMPTY_7: "刘霄霄（药225）",
      __EMPTY_8: "李秀文（药225）",
      __EMPTY_9: "王申（药225）",
      __EMPTY_10: "党心悦（药225）",
      __EMPTY_11: "汪赟（药225）",
    },
  ],
};

function run() {
  // fs.
}