//给你一个整数数组 nums，返回 数组 answer ，其中 answer[i] 等于 nums 中除 nums[i] 之外其余各元素的乘积 。
//
// 题目数据 保证 数组 nums之中任意元素的全部前缀元素和后缀的乘积都在 32 位 整数范围内。
//
// 请不要使用除法，且在 O(n) 时间复杂度内完成此题。
//
//
//
// 示例 1:
//
//
//输入: nums =  [1, 2, 3, 4]
//输入: pre =   [1, 2, 6, 24]
//输入: suf =   [24,24,12,4]
//输出: [24,12,8,6]
//
//
// 示例 2:
//
//
//输入: nums = [-1,1,0,-3,3]
//输出: [0,0,9,0,0]
//
//
//
//
// 提示：
//
//
// 2 <= nums.length <= 10⁵
// -30 <= nums[i] <= 30
// 保证 数组 nums之中任意元素的全部前缀元素和后缀的乘积都在 32 位 整数范围内
//
//
//
//
// 进阶：你可以在 O(1) 的额外空间复杂度内完成这个题目吗？（ 出于对空间复杂度分析的目的，输出数组不被视为额外空间。）
//
// Related Topics 数组 前缀和 👍 1483 👎 0

//leetcode submit region begin(Prohibit modification and deletion)
function productExceptSelf(nums: number[]): number[] {
  const pre: number[] = [];

  for (let i = 0; i < nums.length; i++) {
    pre[i] = (pre[i - 1] ?? 1) * nums[i];
  }
  let sum = 1;
  for (let i = nums.length - 1; i >= 0; i--) {
    pre[i] = (pre[i - 1] ?? 1) * sum;
    sum *= nums[i];
  }
  return pre;
}


//leetcode submit region end(Prohibit modification and deletion)
